package by.training.java.module_6.task02.launch;

import by.training.java.module_6.task02.logic.Menu;

public class Main {

    public static void main(String[] args) {
		/*
		  -Блокнот. Разработать консольное приложение, работающее с Заметками
		   в Блокноте. Каждая Заметка это: Заметка (тема, дата создания, е-mail, сообщение).
		  -В начале работы приложения данные должны считываться из файла, в конце
		   работы - сохраняться в файл.
		  -У пользователя должна быть возможность найти запись по любому параметру
		   или по группе параметров (группу параметров можно определить
		   самостоятельно), получить требуемые записи в отсортированном виде, найти
		   записи, текстовое поле которой содержит определенное слово, а также
		   добавить новую запись.
		  -Особое условие: поиск, сравнение и валидацию вводимой информации
		   осуществлять с использованием регулярных выражений.
		  -Особое условие: проверку введенной информации на валидность должен
		   осуществлять код, непосредственно добавляющий информацию.
		*/

        Menu menu = new Menu();
    }
}
